# **Esercizi Pandas**

In [25]:
import pandas as pd
import numpy as np

## **Esercizio 1**
Utilizzare un dataset di esempio che include le seguenti informazioni su un gruppo di persone: Nome, Età, Città e Salario.

1. Caricare i dati in un DataFrame autogenerandoli casualmente.

In [2]:
import random

In [26]:
Base_nomi=['Martina','Giuseppe','Valeria','Sofia','Giulia','Francesco','Cristian','Mario','Valentina','Fabio',np.nan]
Base_città=['Palermo','Cagliari','Catanzaro','Potenza','Bari','Campobasso', 'Ancona','Roma','Firenze','Bologna',np.nan]

In [27]:
Nomi = random.choices(Base_nomi, k=100)
Città = random.choices(Base_città, k=100)
Età = [random.randint(16, 80) for _ in range(100)]
Salario = [random.uniform(1000, 5000) for _ in range(100)]

In [28]:
data = {'Nomi':Nomi,'Città':Città,'Età':Età,'Salario':Salario}

In [29]:
df = pd.DataFrame(data)

2. Visualizzare le prime e le ultime cinque righe del DataFrame.

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Nomi     90 non-null     object
 1   Città    90 non-null     object
 2   Età      100 non-null    int64
 3   Salario  100 non-null    float64
dtypes: float64(1), int64(1), object(2)
memory usage: 3.3+ KB

In [19]:
df.head(5)

        Nomi    Città  Età      Salario
0    Martina   Ancona   37  1936.620376
1      Sofia  Potenza   43  1724.545994
2      Mario  Palermo   39  3629.581752
3      Fabio     Roma   32  3481.917033
4  Valentina   Ancona   24  4704.639401

In [20]:
df.tail(5)

         Nomi    Città  Età      Salario
95     Giulia  Firenze   71  2679.447983
96   Cristian  Firenze   19  2080.480635
97  Valentina  Palermo   60  2460.261682
98      Fabio     Bari   48  1066.634160
99  Francesco   Ancona   32  2677.114031

3. Visualizzare il tipo di dati di ciascuna colonna.

In [17]:
df.dtypes

Nomi        object
Città       object
Età          int64
Salario    float64
dtype: object

4. Calcolare statistiche descrittive di base per le colonne numeriche (media, mediana, deviazione standard).

In [21]:
print("Media Età:",df['Età'].mean(),"\nMediana Età:",df['Età'].median(),"\nDeviazione Standard Età:",df['Età'].std())
print("Media Salario:",df['Salario'].mean(),"\nMediana Salario:",df['Salario'].median(),"\nDeviazione Standard Salario:",df['Salario'].std())

Media Età: 48.17
Mediana Età: 48.0
Deviazione Standard Età: 16.341095867212033
Media Salario: 2896.1790981560816
Mediana Salario: 2747.606185780204
Deviazione Standard Salario: 1122.7899194161448

5. Identificare e rimuovere eventuali duplicati.

In [24]:
duplicati = df.duplicated()
print(duplicati)

0     False
1     False
2     False
3     False
4     False
      ...
95    False
96    False
97    False
98    False
99    False
Length: 100, dtype: bool

In [22]:
df = df.drop_duplicates()

6. Gestire i valori mancanti sostituendoli con la mediana della rispettiva
colonna.

In [ ]:
    
    df['Nome'].fillna(df['Età'].mean(), inplace=True)